'''
图像的膨胀
'''
import cv2
import numpy as np
img = cv2.imread('../data/9.png',0)
cv2.imshow('img',img)

# 膨胀核
kernel = np.ones((3,3),np.uint8)
res = cv2.dilate(img, # 原始图像
                    kernel,  # 腐蚀核
                    iterations=4) # 迭代次数


cv2.imshow("res", res)

cv2.waitKey()
cv2.destroyAllWindows()


# 二值图像：
# 0：黑色（背景）
# 255：白色（前景）

# 3×3全1核：
# kernel = np.array([
#     [1, 1, 1],
#     [1, 1, 1],
#     [1, 1, 1]
# ], dtype=np.uint8)

# 腐蚀（Erosion）
# 原理
# 操作：将核的中心对准当前像素，若核覆盖的所有像素均为255，则核的中心对准的这个当前像素，应当输出255，否则输出0。
# 效果：白色区域（前景）缩小，边界向内收缩。

# 腐蚀	 核内全部为255才保留
# 膨胀	 核内存在一个255即填充

# 腐蚀
# 对于中心像素
# P(x,y)
# 核覆盖的 所有位置（若核值为1）对应的原图像像素中至少有一个为255。

# 输出规则：
# 如果任一核为1的位置对应的原图像像素为255 → 输出255。
# 否则 → 输出0。

# 腐蚀
# 对于中心像素
# P(x,y)
# 核覆盖的 所有位置（若核值为1）对应的原图像像素中至少有一个为255。

# 输出规则：
# 如果核为1的位置对应的所有原图像像素中，只要有一个为255 → 核中心对应的像素输出255。
# 否则 → 输出0。


# 如果核包含0值（如十字形核），则仅核为1的位置参与判断：
# 示例：十字核
# kernel = np.array([
#     [0, 1, 0],
#     [1, 1, 1],
#     [0, 1, 0]
# ], dtype=np.uint8)
# 腐蚀：仅需核为1的位置（十字区域）对应的原图像像素全为255。
# 膨胀：仅需核为1的位置中存在至少一个255。

# 此处用二值图像来阐释原理  更加方便简单
# 实际上应该是灰度图像  但原理类似  可查ds






